[
  "dataview",
  "obsidian-plantuml",
  "obsidian-admonition",
  "cm-editor-syntax-highlight-obsidian",
  "tag-wrangler",
  "templater-obsidian",
  "markdown-prettifier",
  "customjs",
  "obsidian-banners",
  "cmenu-plugin",
  "obsidian-annotator"
]