[
  "dataview",
  "obsidian-plantuml",
  "obsidian-admonition",
  "cm-editor-syntax-highlight-obsidian",
  "tag-wrangler",
  "templater-obsidian",
  "obsidian-icon-folder",
  "table-editor-obsidian",
  "sliding-panes-obsidian",
  "markdown-prettifier"
]